<?xml version="1.0" ?>
<net name="model-mobilenet_v1_101" version="7">
	<layers>
		<layer id="0" name="image" type="Input">
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="MobilenetV1/Conv2D" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>257</dim>
					<dim>257</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" precision="FP16" size="1728"/>
				<biases offset="1728" precision="FP16" size="64"/>
			</blobs>
		</layer>
		<layer id="2" name="MobilenetV1/Relu6" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="MobilenetV1/depthwise" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="32" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1792" precision="FP16" size="576"/>
				<biases offset="2368" precision="FP16" size="64"/>
			</blobs>
		</layer>
		<layer id="4" name="MobilenetV1/Relu6_1" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="MobilenetV1/Conv2D_1" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2432" precision="FP16" size="4096"/>
				<biases offset="6528" precision="FP16" size="128"/>
			</blobs>
		</layer>
		<layer id="6" name="MobilenetV1/Relu6_2" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="MobilenetV1/depthwise_1" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="64" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>65</dim>
					<dim>65</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6656" precision="FP16" size="1152"/>
				<biases offset="7808" precision="FP16" size="128"/>
			</blobs>
		</layer>
		<layer id="8" name="MobilenetV1/Relu6_3" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>65</dim>
					<dim>65</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>65</dim>
					<dim>65</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="MobilenetV1/Conv2D_2" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>65</dim>
					<dim>65</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>65</dim>
					<dim>65</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7936" precision="FP16" size="16384"/>
				<biases offset="24320" precision="FP16" size="256"/>
			</blobs>
		</layer>
		<layer id="10" name="MobilenetV1/Relu6_4" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>65</dim>
					<dim>65</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>65</dim>
					<dim>65</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="MobilenetV1/depthwise_2" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="128" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>65</dim>
					<dim>65</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>65</dim>
					<dim>65</dim>
				</port>
			</output>
			<blobs>
				<weights offset="24576" precision="FP16" size="2304"/>
				<biases offset="26880" precision="FP16" size="256"/>
			</blobs>
		</layer>
		<layer id="12" name="MobilenetV1/Relu6_5" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>65</dim>
					<dim>65</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>65</dim>
					<dim>65</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="MobilenetV1/Conv2D_3" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>65</dim>
					<dim>65</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>65</dim>
					<dim>65</dim>
				</port>
			</output>
			<blobs>
				<weights offset="27136" precision="FP16" size="32768"/>
				<biases offset="59904" precision="FP16" size="256"/>
			</blobs>
		</layer>
		<layer id="14" name="MobilenetV1/Relu6_6" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>65</dim>
					<dim>65</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>65</dim>
					<dim>65</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="MobilenetV1/depthwise_3" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="128" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>65</dim>
					<dim>65</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
			</output>
			<blobs>
				<weights offset="60160" precision="FP16" size="2304"/>
				<biases offset="62464" precision="FP16" size="256"/>
			</blobs>
		</layer>
		<layer id="16" name="MobilenetV1/Relu6_7" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="MobilenetV1/Conv2D_4" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
			</output>
			<blobs>
				<weights offset="62720" precision="FP16" size="65536"/>
				<biases offset="128256" precision="FP16" size="512"/>
			</blobs>
		</layer>
		<layer id="18" name="MobilenetV1/Relu6_8" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="MobilenetV1/depthwise_4" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="256" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
			</output>
			<blobs>
				<weights offset="128768" precision="FP16" size="4608"/>
				<biases offset="133376" precision="FP16" size="512"/>
			</blobs>
		</layer>
		<layer id="20" name="MobilenetV1/Relu6_9" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="MobilenetV1/Conv2D_5" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
			</output>
			<blobs>
				<weights offset="133888" precision="FP16" size="131072"/>
				<biases offset="264960" precision="FP16" size="512"/>
			</blobs>
		</layer>
		<layer id="22" name="MobilenetV1/Relu6_10" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="MobilenetV1/depthwise_5" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="256" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>33</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="265472" precision="FP16" size="4608"/>
				<biases offset="270080" precision="FP16" size="512"/>
			</blobs>
		</layer>
		<layer id="24" name="MobilenetV1/Relu6_11" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="MobilenetV1/Conv2D_6" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="270592" precision="FP16" size="262144"/>
				<biases offset="532736" precision="FP16" size="1024"/>
			</blobs>
		</layer>
		<layer id="26" name="MobilenetV1/Relu6_12" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="MobilenetV1/depthwise_6" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="512" kernel="3,3" output="512" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="533760" precision="FP16" size="9216"/>
				<biases offset="542976" precision="FP16" size="1024"/>
			</blobs>
		</layer>
		<layer id="28" name="MobilenetV1/Relu6_13" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="MobilenetV1/Conv2D_7" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="544000" precision="FP16" size="524288"/>
				<biases offset="1068288" precision="FP16" size="1024"/>
			</blobs>
		</layer>
		<layer id="30" name="MobilenetV1/Relu6_14" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="MobilenetV1/depthwise_7" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="512" kernel="3,3" output="512" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1069312" precision="FP16" size="9216"/>
				<biases offset="1078528" precision="FP16" size="1024"/>
			</blobs>
		</layer>
		<layer id="32" name="MobilenetV1/Relu6_15" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="MobilenetV1/Conv2D_8" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1079552" precision="FP16" size="524288"/>
				<biases offset="1603840" precision="FP16" size="1024"/>
			</blobs>
		</layer>
		<layer id="34" name="MobilenetV1/Relu6_16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="MobilenetV1/depthwise_8" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="512" kernel="3,3" output="512" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1604864" precision="FP16" size="9216"/>
				<biases offset="1614080" precision="FP16" size="1024"/>
			</blobs>
		</layer>
		<layer id="36" name="MobilenetV1/Relu6_17" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="MobilenetV1/Conv2D_9" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1615104" precision="FP16" size="524288"/>
				<biases offset="2139392" precision="FP16" size="1024"/>
			</blobs>
		</layer>
		<layer id="38" name="MobilenetV1/Relu6_18" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="MobilenetV1/depthwise_9" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="512" kernel="3,3" output="512" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2140416" precision="FP16" size="9216"/>
				<biases offset="2149632" precision="FP16" size="1024"/>
			</blobs>
		</layer>
		<layer id="40" name="MobilenetV1/Relu6_19" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="MobilenetV1/Conv2D_10" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2150656" precision="FP16" size="524288"/>
				<biases offset="2674944" precision="FP16" size="1024"/>
			</blobs>
		</layer>
		<layer id="42" name="MobilenetV1/Relu6_20" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="MobilenetV1/depthwise_10" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="512" kernel="3,3" output="512" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2675968" precision="FP16" size="9216"/>
				<biases offset="2685184" precision="FP16" size="1024"/>
			</blobs>
		</layer>
		<layer id="44" name="MobilenetV1/Relu6_21" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="MobilenetV1/Conv2D_11" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2686208" precision="FP16" size="524288"/>
				<biases offset="3210496" precision="FP16" size="1024"/>
			</blobs>
		</layer>
		<layer id="46" name="MobilenetV1/Relu6_22" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="MobilenetV1/depthwise_11" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="512" kernel="3,3" output="512" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3211520" precision="FP16" size="9216"/>
				<biases offset="3220736" precision="FP16" size="1024"/>
			</blobs>
		</layer>
		<layer id="48" name="MobilenetV1/Relu6_23" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="MobilenetV1/Conv2D_12" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="1024" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3221760" precision="FP16" size="1048576"/>
				<biases offset="4270336" precision="FP16" size="2048"/>
			</blobs>
		</layer>
		<layer id="50" name="MobilenetV1/Relu6_24" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="MobilenetV1/depthwise_12" type="Convolution">
			<data dilations="2,2" group="1024" kernel="3,3" output="1024" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4272384" precision="FP16" size="18432"/>
				<biases offset="4290816" precision="FP16" size="2048"/>
			</blobs>
		</layer>
		<layer id="52" name="MobilenetV1/Relu6_25" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="MobilenetV1/Conv2D_13" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="1024" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4292864" precision="FP16" size="2097152"/>
				<biases offset="6390016" precision="FP16" size="2048"/>
			</blobs>
		</layer>
		<layer id="54" name="MobilenetV1/Relu6_26" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv2D_3" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6392064" precision="FP16" size="65536"/>
				<biases offset="6457600" precision="FP16" size="64"/>
			</blobs>
		</layer>
		<layer id="56" name="Conv2D_2" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6457664" precision="FP16" size="65536"/>
				<biases offset="6523200" precision="FP16" size="64"/>
			</blobs>
		</layer>
		<layer id="57" name="Conv2D" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="17" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6523264" precision="FP16" size="34816"/>
				<biases offset="6558080" precision="FP16" size="34"/>
			</blobs>
		</layer>
		<layer id="58" name="heatmap" type="Activation">
			<data type="sigmoid"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>17</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv2D_1" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="34" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>34</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6558114" precision="FP16" size="69632"/>
				<biases offset="6627746" precision="FP16" size="68"/>
			</blobs>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
		<edge from-layer="1" from-port="3" to-layer="2" to-port="0"/>
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0"/>
		<edge from-layer="3" from-port="3" to-layer="4" to-port="0"/>
		<edge from-layer="4" from-port="1" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="3" to-layer="6" to-port="0"/>
		<edge from-layer="6" from-port="1" to-layer="7" to-port="0"/>
		<edge from-layer="7" from-port="3" to-layer="8" to-port="0"/>
		<edge from-layer="8" from-port="1" to-layer="9" to-port="0"/>
		<edge from-layer="9" from-port="3" to-layer="10" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="11" to-port="0"/>
		<edge from-layer="11" from-port="3" to-layer="12" to-port="0"/>
		<edge from-layer="12" from-port="1" to-layer="13" to-port="0"/>
		<edge from-layer="13" from-port="3" to-layer="14" to-port="0"/>
		<edge from-layer="14" from-port="1" to-layer="15" to-port="0"/>
		<edge from-layer="15" from-port="3" to-layer="16" to-port="0"/>
		<edge from-layer="16" from-port="1" to-layer="17" to-port="0"/>
		<edge from-layer="17" from-port="3" to-layer="18" to-port="0"/>
		<edge from-layer="18" from-port="1" to-layer="19" to-port="0"/>
		<edge from-layer="19" from-port="3" to-layer="20" to-port="0"/>
		<edge from-layer="20" from-port="1" to-layer="21" to-port="0"/>
		<edge from-layer="21" from-port="3" to-layer="22" to-port="0"/>
		<edge from-layer="22" from-port="1" to-layer="23" to-port="0"/>
		<edge from-layer="23" from-port="3" to-layer="24" to-port="0"/>
		<edge from-layer="24" from-port="1" to-layer="25" to-port="0"/>
		<edge from-layer="25" from-port="3" to-layer="26" to-port="0"/>
		<edge from-layer="26" from-port="1" to-layer="27" to-port="0"/>
		<edge from-layer="27" from-port="3" to-layer="28" to-port="0"/>
		<edge from-layer="28" from-port="1" to-layer="29" to-port="0"/>
		<edge from-layer="29" from-port="3" to-layer="30" to-port="0"/>
		<edge from-layer="30" from-port="1" to-layer="31" to-port="0"/>
		<edge from-layer="31" from-port="3" to-layer="32" to-port="0"/>
		<edge from-layer="32" from-port="1" to-layer="33" to-port="0"/>
		<edge from-layer="33" from-port="3" to-layer="34" to-port="0"/>
		<edge from-layer="34" from-port="1" to-layer="35" to-port="0"/>
		<edge from-layer="35" from-port="3" to-layer="36" to-port="0"/>
		<edge from-layer="36" from-port="1" to-layer="37" to-port="0"/>
		<edge from-layer="37" from-port="3" to-layer="38" to-port="0"/>
		<edge from-layer="38" from-port="1" to-layer="39" to-port="0"/>
		<edge from-layer="39" from-port="3" to-layer="40" to-port="0"/>
		<edge from-layer="40" from-port="1" to-layer="41" to-port="0"/>
		<edge from-layer="41" from-port="3" to-layer="42" to-port="0"/>
		<edge from-layer="42" from-port="1" to-layer="43" to-port="0"/>
		<edge from-layer="43" from-port="3" to-layer="44" to-port="0"/>
		<edge from-layer="44" from-port="1" to-layer="45" to-port="0"/>
		<edge from-layer="45" from-port="3" to-layer="46" to-port="0"/>
		<edge from-layer="46" from-port="1" to-layer="47" to-port="0"/>
		<edge from-layer="47" from-port="3" to-layer="48" to-port="0"/>
		<edge from-layer="48" from-port="1" to-layer="49" to-port="0"/>
		<edge from-layer="49" from-port="3" to-layer="50" to-port="0"/>
		<edge from-layer="50" from-port="1" to-layer="51" to-port="0"/>
		<edge from-layer="51" from-port="3" to-layer="52" to-port="0"/>
		<edge from-layer="52" from-port="1" to-layer="53" to-port="0"/>
		<edge from-layer="53" from-port="3" to-layer="54" to-port="0"/>
		<edge from-layer="54" from-port="1" to-layer="55" to-port="0"/>
		<edge from-layer="54" from-port="1" to-layer="56" to-port="0"/>
		<edge from-layer="54" from-port="1" to-layer="57" to-port="0"/>
		<edge from-layer="57" from-port="3" to-layer="58" to-port="0"/>
		<edge from-layer="54" from-port="1" to-layer="59" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2020.1.0-61-gd349c3ba4a"/>
		<cli_parameters>
			<blobs_as_inputs value="True"/>
			<caffe_parser_path value="DIR"/>
			<data_type value="FP16"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<enable_ssd_gluoncv value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_deprecated_IR_V2 value="False"/>
			<generate_deprecated_IR_V7 value="True"/>
			<generate_experimental_IR_V10 value="False"/>
			<input value="image"/>
			<input_model value="DIR\model-mobilenet_v1_101.pb"/>
			<input_model_is_text value="False"/>
			<input_shape value="[1,257,257,3]"/>
			<k value="DIR\CustomLayersMapping.xml"/>
			<keep_quantize_ops_in_IR value="True"/>
			<keep_shape_ops value="False"/>
			<legacy_mxnet_model value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="model-mobilenet_v1_101"/>
			<move_to_preprocess value="False"/>
			<output value="['offset_2', 'displacement_fwd_2', 'displacement_bwd_2', 'heatmap']"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<placeholder_shapes value="{'image': array([  1, 257, 257,   3], dtype=int64)}"/>
			<progress value="False"/>
			<remove_memory value="False"/>
			<remove_output_softmax value="False"/>
			<reverse_input_channels value="False"/>
			<save_params_from_nd value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<stream_output value="False"/>
			<unset unset_cli_parameters="batch, counts, disable_fusing, disable_gfusing, finegrain_fusing, input_checkpoint, input_meta_graph, input_proto, input_symbol, mean_file, mean_file_offsets, nd_prefix_name, pretrained_model_name, saved_model_dir, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_operation_patterns, tensorflow_subgraph_patterns, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
